In [1]:
# Import library
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
# Read the internet table
internet = pd.read_csv('internet.csv')
# Take a look at the first rows
internet

                           Entity Code  Year  Internet_Usage
0                     Afghanistan  AFG  1990        0.000000
1                     Afghanistan  AFG  1991        0.000000
2                     Afghanistan  AFG  1992        0.000000
3                     Afghanistan  AFG  1993        0.000000
4                     Afghanistan  AFG  1994        0.000000
...                           ...  ...   ...             ...
4995  Pacific island small states  NaN  2007        7.389746
4996  Pacific island small states  NaN  2008        8.689416
4997  Pacific island small states  NaN  2009       10.868467
4998  Pacific island small states  NaN  2010       12.961165
4999  Pacific island small states  NaN  2011       17.599898

[5000 rows x 4 columns]

In [7]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Entity          5000 non-null   object
 1   Code            3929 non-null   object
 2   Year            5000 non-null   int64
 3   Internet_Usage  5000 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 156.4+ KB

**Internet**
+ "Entity" - The name of the country, region, or group.
+ "Code" - Unique id for the country (null for other entities).
+ "Year" - Year from 1990 to 2019.
+ "Internet_usage" - The share of the entity's population who have used the internet in the last three months.

In [10]:
# Read the broadband table
broadband = pd.read_csv('broadband.csv')
broadband

           Entity Code  Year  Broadband_Subscriptions
0     Afghanistan  AFG  2004                 0.000809
1     Afghanistan  AFG  2005                 0.000858
2     Afghanistan  AFG  2006                 0.001892
3     Afghanistan  AFG  2007                 0.001845
4     Afghanistan  AFG  2008                 0.001804
...           ...  ...   ...                      ...
3883     Zimbabwe  ZWE  2016                 1.217633
3884     Zimbabwe  ZWE  2017                 1.315694
3885     Zimbabwe  ZWE  2018                 1.406322
3886     Zimbabwe  ZWE  2019                 1.395818
3887     Zimbabwe  ZWE  2020                 1.368916

[3888 rows x 4 columns]

In [13]:
broadband.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3888 entries, 0 to 3887
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Entity                   3888 non-null   object
 1   Code                     3617 non-null   object
 2   Year                     3888 non-null   int64
 3   Broadband_Subscriptions  3888 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 121.6+ KB

In [15]:
broadband.Year.unique()

array([2004, 2005, 2006, 2007, 2008, 2009, 2010, 2012, 2013, 2014, 2015,
       2016, 2017, 2018, 2019, 2020, 2011, 2003, 2002, 2001, 1999, 2000,
       1998], dtype=int64)

In [16]:
broadband.Year.min()

1998

In [17]:
broadband.Year.max()

2020

**broadband**
+ "Entity" - The name of the country, region, or group.
+ "Code" - Unique id for the country (null for other entities).
+ "Year" - Year from 1998 to 2020.
+ "Broadband_Subscriptions" - The number of fixed subscriptions to high-speed internet at downstream speeds >= 256 kbit/s for that country, region, or group.

In [12]:
# Read the people table
people = pd.read_csv('people.csv')
people

            Entity Code  Year    Users
0      Afghanistan  AFG  1990        0
1      Afghanistan  AFG  1991        0
2      Afghanistan  AFG  1992        0
3      Afghanistan  AFG  1993        0
4      Afghanistan  AFG  1994        0
...            ...  ...   ...      ...
4995  Saudi Arabia  SAU  1997    10388
4996  Saudi Arabia  SAU  1998    20765
4997  Saudi Arabia  SAU  1999   103701
4998  Saudi Arabia  SAU  2000   476347
4999  Saudi Arabia  SAU  2001  1033854

[5000 rows x 4 columns]